{
  "data": {
    "lesson": {
      "id": 840095,
      "key": "51f0c41f-2a96-40db-aa41-3447fa464dc7",
      "title": "Unscramble Computer Science Problems",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "Deconstruct a series of open-ended problems into smaller components (e.g,  inputs, outputs, series of functions).\n",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": {
        "files": [
          {
            "name": "P0 project starter codes",
            "uri": "https://video.udacity-data.com/topher/2021/March/606392d5_p0/p0.zip"
          }
        ],
        "google_plus_link": null,
        "career_resource_center_link": null,
        "coaching_appointments_link": null,
        "office_hours_link": null,
        "aws_provisioning_link": null
      },
      "project": {
        "key": "b65bff3d-e04e-4502-8f38-37de9ac57386",
        "version": "1.0.0",
        "locale": "en-us",
        "duration": 21600,
        "semantic_type": "Project",
        "title": "Unscramble Computer Science Problems",
        "description": " Submission\n======\nSubmit zip file named as **submit.zip** with **ONLY** the following files:\n\n- Task0.py\n- Task1.py\n- Task2.py\n- Task3.py\n- Task4.py\n- Analysis.txt\n\n\nBe sure you have crossed check your work with the rubric [here.](https://review.udacity.com/#!/rubrics/2530/view)\n\n## Project Submission Checklist\n\n**Before submitting your project, please review and confirm the following items.** \n<input type=\"checkbox\"> I am confident all rubric items have been met and my project will pass as submitted. \n<input type=\"checkbox\"> Project builds correctly without errors and runs.\n<input type=\"checkbox\"> All required functionality exists and my project behaves as expected per the project's specifications.\n\n**Once you have checked all these items, you are ready to submit!**\n",
        "is_public": true,
        "summary": null,
        "forum_path": "",
        "rubric_id": "2530",
        "terminal_project_id": null,
        "resources": null,
        "image": null
      },
      "lab": null,
      "concepts": [
        {
          "id": 840621,
          "key": "8070cf22-0fbc-4e9a-933a-b10ba5a095ee",
          "title": "Project Introduction",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "8070cf22-0fbc-4e9a-933a-b10ba5a095ee",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 840624,
              "key": "d8e495ae-1c24-40bd-a078-85fd361d863c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Investigating Texts and Calls\n\n---\n\nProject Overview\n================\nIn this project, you will complete five tasks based on a fabricated set of calls and texts exchanged during September 2016. You will use Python to analyze and answer questions about the texts and calls contained in the dataset. Lastly, you will perform run time analysis of your solution and determine its efficiency.  \n\nWhat will I learn?\n---------------------------\nIn this project, you will:\n\n* Apply your Python knowledge to breakdown problems into their inputs and outputs.\n* Perform an efficiency analysis of your solution. \n* Warm up your Python skills for the course. \n\nWhy this Project?\n-------------\nYou'll apply the skills you've learned so far in a more realistic scenario. The five tasks are structured to give you experience with a variety of programming problems. You will receive code review of your work; this personal feedback will help you to improve your solutions.\n\nStep 1 - Download the Files\n--------\nDownload and open the zipped folder [here](https://video.udacity-data.com/topher/2021/March/606392d5_p0/p0.zip). In the folder you will find five python files `Task0.py`, `Task1.py`, ...,`Task4.py` and two csv files `calls.csv` and `texts.csv`\n\nAbout the data\n---------\nThe text and call data are provided in csv files.\n\nThe text data (`text.csv`) has the following columns: sending telephone number (string), receiving telephone number (string),  timestamp of text message (string).\n\nThe call data (`call.csv`) has the following columns: calling telephone number (string), receiving telephone number (string), start timestamp of telephone call (string), duration of telephone call in seconds (string)\n\nAll telephone numbers are 10 or 11 numerical digits long. Each telephone number starts with a code indicating the location and/or type of the telephone number.\nThere are three different kinds of telephone numbers, each with a different format:\n\n* Fixed lines start with an area code enclosed in brackets. The area codes vary in length but always begin with 0. Example: \"(**022**)40840621\".\n* Mobile numbers have no parentheses, but have a space in the middle of the number to help readability. The mobile code of a mobile number is its first four digits and they always start with 7, 8 or 9. Example: \"**9341**2 66159\".\n* Telemarketers' numbers have no parentheses or space, but start with the code 140. Example: \"**140**2316533\".\n\nStep 2 - Implement the Code\n----------\nComplete the five tasks (`Task0.py`, `Task1.py`, ...,`Task4.py`).  Do not change the data or instructions, simply add your code below what has been provided. Include all the code that you need for each task in that file. \n\nIn Tasks 3 and 4, you can use in-built methods `sorted()` or `list.sort()` for sorting which are the implementation of Timsort and Samplesort, respectively. Both these sorting methods have a worst-case time-complexity of *O(n log n).* Check the below links to learn more about these methods:\n* How to use the above methods - https://docs.python.org/3/howto/sorting.html\n* Complexity analysis of Timsort and Samplesort - http://svn.python.org/projects/python/trunk/Objects/listsort.txt\n\nThe solution outputs for each file should be the print statements described in the instructions. Feel free to use other print statements during the development process, but remember to remove them for submission - the submitted files should print only the solution outputs.\n\nStep 3 - Calculate Big O\n---------\nOnce you have completed your solution for each problem, perform a run time analysis (Worst Case Big-O Notation) of your solution. Document this for each problem and include this in your submission. \n\n\nStep 4 - Check again Rubric and Submit\n---------\nUse the rubric to check your work before submission. A Udacity Reviewer will give feedback on your work based on this rubric and will leave helpful comments on your code.",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}